[{"business_id":"68dUKd8_8liJ7in4aWOSEA","name":["The UPS Store"],"address":["Credit Valley Town Plaza, F2 - 6045 Creditview Rd"],"city":["Mississauga"],"state":["ON"],"stars":["2.5"],"review_count":["3"],"attributes":["{'BusinessParking': "{'garage': False, 'street': False, 'validated': False, 'lot': False, 'valet': False}", 'RestaurantsPriceRange2': '2'}"],"categories":["Shipping Centers, Couriers & Delivery Services, Local Services, Printing Services"],"reviews":["{date=2014-01-29 20:11:57, stars=1.0, text=horrible. do not go.  staff is dishonest and scammers.  purchased stamps there and they charged me $9.00 for a book of stamps.  stamps are .63.  when confronted they told me there was a service charge.  service charge on a government product? come on!  never again will i go here, nor use ups services again!}","{date=2014-04-11 02:37:51, stars=4.0, text=The person I was deal with was great. She was very friendly and helpful in getting my things done. I was their to get my card laminated and the staff was very friendly in making that happen and they also told me it would take few mins to warm up the machine and I can come back. So I went  to the bank as its part of a big plaza and its near pharma plus and nofrills so you can get other thing done as well.}"]},{"business_id":"QXAEGFB4oINsVuTFxEYKFQ","name":["Emerald Chinese Restaurant ups"],"address":["30 Eglinton Avenue W"],"city":["Mississauga"],"state":["ON"],"stars":["2.5"],"review_count":["128"],"attributes":["{'RestaurantsReservations': 'True', 'GoodForMeal': "{'dessert': False, 'latenight': False, 'lunch': True, 'dinner': True, 'brunch': False, 'breakfast': False}", 'BusinessParking': "{'garage': False, 'street': False, 'validated': False, 'lot': True, 'valet': False}", 'Caters': 'True', 'NoiseLevel': "u'loud'", 'RestaurantsTableService': 'True', 'RestaurantsTakeOut': 'True', 'RestaurantsPriceRange2': '2', 'OutdoorSeating': 'False', 'BikeParking': 'False', 'Ambience': "{'romantic': False, 'intimate': False, 'classy': False, 'hipster': False, 'divey': False, 'touristy': False, 'trendy': False, 'upscale': False, 'casual': True}", 'HasTV': 'False', 'WiFi': "u'no'", 'GoodForKids': 'True', 'Alcohol': "u'full_bar'", 'RestaurantsAttire': "u'casual'", 'RestaurantsGoodForGroups': 'True', 'RestaurantsDelivery': 'False'}"],"categories":["Specialty Food, Restaurants, Dim Sum, Imported Food, Food, Chinese, Ethnic Food, Seafood"],"reviews":["{date=2017-01-27 21:54:30, stars=3.0, text=My girlfriend and I went for dinner at Emerald Chinese after a Thursday night workout.We arrived around 7:30pm and were seated after a short wait.  After browsing the menu and a brief discussion with our waiter, we ordered seafood noodles and a 3 item mix meat plate (BBQ pork, chicken, and duck)The food came soon thereafter and it was hot and delicious.  There was large portions and lots of seafood in the seafood noodles and the mix meat plate came with good cuts of meat and the correct sauces.After the meal, we received fortune cookies for dessert.FoodThe food was good quality.  Ingredients tasted fresh and dishes tasted well made.  Food is above average but nothing stood out even though I was quite hungry.PricePrice is high in comparative to other Chinese cuisine, and comparable to large western restaurant chains.Service:The service is average to slightly below average.  A common malaise of chinese restaurants is poor service where the waiter/waitresses are overworked, impatient, unattentive.  Emerald Chinese is no exception.  The waiting staff at the restaurant appear rushed and impatient.  All our services needs were met, but the staff was rushed and grumpy..DecorEmerald has tasteful decorations, comfortable chairs and nice tablecloths.  There is sufficient room to navigate between tables.Overall, we had a good meal with large portions, received average service and paid slightly more than we had hoped for our meal.3.1 / 5.0}","{date=2016-01-04 12:59:22, stars=3.0, text=***No automatic doors, not baby friendly!*** I frequent this Chinese restaurant before and post partum. Dim sum is ok, dishes at dinner time are huge, service is great, BUT there are no automatic doors! How am in supposed to push my stroller inside?!!!}","{date=2011-03-21 14:39:55, stars=4.0, text=One of the gauges of a good Chinese restaurant is the number of Chinese people who patronize the place. Emerald Chinese Restaurant has a lot of patrons.My wife and I mainly come for the dim sum  brunch (9:00 AM ~ 11:00 AM) on weekends. The food is great, the place is clean, and there is ample parking around the restaurant. From within the restaurant, you can easily see outside as three of the four walls are made of glass. This gives the place a sense of airiness that some places we go to do not.*The ideal time to come on weekends is between 10:00 AM and 11:00 AM. Come before 10 AM and not all the food is available yet. Come after 11 AM, expect to fall in line. The staff is efficient, but do not expect a lengthy conversation. For a place like this, this is not a put down. It's what I expect.The quality of the dim sum is comparable to what you'd get in a good Hong Kong dim sum restaurant. The hot food is mostly brought out in steamer carts which means that it reaches your table hot and fresh. Fried foods and dessert items do not come in the steamer carts. The turnaround is pretty quick (a food cart seems to be depleted every two rounds of the tables) so very seldom is the food going around for too long. My personal favorites are the sweet pork - served either in a steamed bun or in flaky pastry, chicken feet, shrimp - served in a dumpling or the white rice wrap, pork and century egg congee, and the douhua (silken tofu) with syrup. My wife loves the giant oyster served on its shell with garlic and glass noodles.There may be a few fancier places out there but if fancy is not that important to you, then this place is difficult to beat.}","{date=2015-02-17 00:10:02, stars=3.0, text=We chose this restaurant for our Chinese New Year dinner. The menu has a wide variety of dishes. The service was par. We order the pre fix menu and some side dishes . The waiter was at first not acoomendating but after a discussion with my dad they agreed on what we asked for. The food was mediocre to good. Most dishes were hot and tasty besides a few that were a bit salty. Overall the experience was good.}","{date=2016-01-18 17:49:39, stars=3.0, text=My family and I were at Emerald yesterday during the busiest point of dim sum traffic. All I can say is, it is total mayhem. There weren't any lines during the time we were there, but I believe that is because they churn through customers in a manner I have never seen before. The tables are smooshed together to get as many in and out quickly. I can't really blame them, I get it. When you have a good thing, capitalize on it. Though, this atmosphere creates a bit of a frantic assembly line feel that I don't particularly find enjoyable.There is no denying that the food at Emerald is pretty good. When it comes to dim sum, they stand out among the rest as they offer way more options than any other restaurant. Their offerings are unique and plentiful in size but not in overall temperature of dish. Only 1 of the dishes we received were actually the temperature it needed to be. Again, a symptom of the style of restaurant. Service was perfunctory at best. Cart servers were like street corner merchants hawking their wares. Actually placing items on the table while explaining why you simply needed to have it (in as few words as possible).Overall, 3 stars is being a little more generous than I should be. But the food is actually not bad.}","{date=2010-11-23 00:21:58, stars=3.0, text=Whenever I go here on the weekend, this place is super busy.  Expect to wait about 30 minutes for a table.  This place is also mutli-ethnic.  You will see people of all different races coming here.  This place is one of the chinese dim sum restaurants that white people like to come to.  The food is decent, but it is pricey.  You can find much cheaper dim sum places elsewhere, but if you don't speak chinese you will be more comfortable coming here. Sometimes, depending on what time you come here, there will be barely any food coming around. Derek}","{date=2015-02-24 04:32:58, stars=2.0, text=Despite the poor service here, my family comes here for special occasions because the quality of their dishes is pretty decent. There is a wide variety of dishes and you can also order a 10-course meal if you'd like. The dim sum menu is also very selective.But as mentioned the service is terrible! You'll expect to wait 20-30 mins for your food especially if you come with a large group. I know you cant expect good service from an asian restaurant but I'm used to the quick eat in and out type of meal and it's definitely subpar service here! The waiters are also not very friendly and give you attitude when you ask when your food is coming.I only give this restaurant 2 stars because the ambience of the restaurant is nice and the quality/selection of food is good.}","{date=2015-02-17 03:18:47, stars=3.0, text=This is one of the few bigger chinese restaurants in mississauga. They have solid good food. Although in recent visits, the service has been lacking... My family and I always come here for birthdays, holiday and recently Chinese New Year dinner. In those few times, the service of our food has taken a very long time. The food does not arrive until 20-30 minutes after ordering. Not only that but they did not provide the starter soup. When we question the servers about the wait time, we received some lip. It was only when the managers came to serve us the service was a bit better. Emerald overall is a great restaurant, but next time we might take our family business elsewhere!}","{date=2011-01-13 22:58:57, stars=4.0, text=Good dim sum, not too expensive, out in Mississauga but worth the trip. Our family spent many Sunday brunches here and I always love going with a big group so we can order a larger variety.I think it's consistently good, not consistently great but good and clean and busy which means the food is usually fresh. When I lived in Taipei we would never eat anywhere where there wasn't a wait because that meant the food usually sat around. Which is a policy I usually stick to for Chinese Restaurants. I'm giving it 4 stars mainly because if I want dim sum in Toronto it's usually the place I think of first. But really maybe it should be 3.5?Not sure about the service or non-dim sum menu so this review is just for dim sum.I like anything with bbq pork, especially the bbq pork wrapped in thin sheets of rice noodle, and baked bbq pork buns. I also love the rice noodles with a side of xo sauce, wrapped sticky rice, Chinese broccoli and deep fried sticky rice ball with sesame or red bean paste and egg tarts for dessert.Not sure how useful these descriptions are because I only know the Chinese names so I'm describing the dishes... sorry but if you've been to dim sum before you might be able to figure it out. Next time I go I'll try to update the names.}","{date=2017-01-04 16:00:18, stars=1.0, text=Poor service, overpriced food.  Make sure to check your dim sum bill.  They tried cheating me and making things more expensive.  Very dishonest business and would not go back.}","{date=2016-05-20 23:30:30, stars=4.0, text=Food is really good, the place is super busy during the weekend. I love it. Remembers me China :)But I find the price too high for what it is. I still highly recommend this place.}","{date=2018-02-12 06:10:50, stars=1.0, text=My family(15+ ppl) and I came yesterday to celebrate a baptism and my birthday. We got there and the reservation was under my uncles' name and they already choosed and paid for the dishes they selected for each table.  The waitress was badgering us appetizers/soups but we didn't know that it was extra.... most of it didn't taste really good especially the tripe/liver which made me gag.The basic Chinese food like the sizzling beef, mushrooms, chow mein was really good though. However, the lack of customer service pissed me off. My relative was going to pay but the amount of money they charged was crazy and they added dishes we didn't even have; the manager literally got up in my uncle's face yelling at him and his wife and made her cry by telling them that they're going to call the police. That is not how you treat a customer.  We are never going back because of how we were treated. Overall: the food gets a 3/5 and customer service gets -2/5. I hope they don't treat other customers like that.}","{date=2010-11-28 21:40:03, stars=4.0, text=The dim sum here is really good.  There was a huge lineup on Sunday.  There was alot of variety.  More than many other dim sum restaurants.  if you are close to the airport, this will be a great place to go for dim sum in Mississauga.  It's only about 20min from the Toronto airport.  There is not alot of push carts left in the Toronto area.  Their prices are reasonable.  Four people can be really full on $50 for lunch.  I used to live in Mississauga and this was one of the better restaurants in the area.  If it's a weekend, you'll have to wait at least half an hour at lunch.  If you only have 2 people you might get a table right away.  They have a few 2 people table that no one uses.  Most people come here in groups of 4 or more.}","{date=2016-10-03 00:54:44, stars=2.0, text=I usually come here when nothing else is open, especially during holidays. It takes forever to get your food, especially take out. I usally get there seafood and beef fried rice. Nothing special. Service isnt that great either.. but its the only place open during xmas and new years lol}","{date=2015-05-15 04:51:38, stars=3.0, text=Food was awesome but the service was horrible. I felt like I had to hunt someone down to order items. Might try one more time due to the food being delicious.}","{date=2013-05-12 01:00:49, stars=5.0, text=this place is the best place to get dim sum ! the food is delicious and the staff is always welcoming and attentive to our needs, the only thing im not crazy about it the washrooms, and anyone who knows me knows I like to see how clean a place is based on the cleanliness of their bathrooms}","{date=2018-08-16 22:01:41, stars=4.0, text=This is your standard dim sum however its a bit more expensive than other dim sum locations in the area. Overall a good experience and would recommend to try out. Had their 11 course menu and the food was all very tasty and cooked well. There is a great bubble tea store next door too!}","{date=2010-10-13 19:29:44, stars=2.0, text=I'm writing this update based on the lunch I had here today. I'm so annoyed that the service is so incredibly rude. I can understand that they might be busy, and need to move fast. Sometimes they respond to me, but they look the other way, I'm okay with that too. But today we went, and I would ask people for tea, and cutlery and things, and they would put a grump face and storm away, only to come back with the minimal amount of things. I mean, we asked for hot sauce, and he just  violently squeezed hot sauce in everyone's bowls! I was shocked, and then so I asked for more bowls. And he stomped off and brought me just one bowl. (What about everyone else)Some other servers are quite nice. If you need anything, try to flag down the guy in the suit/tie or the ladies in the black blazers. Anyone else will just throw things at you (figuratively)They also again, tried to put stuff on our table, and I had to tell them to take it back. When she was confused what i wanted, I got yelled at. I think if you are a regular and they get to know you the service would be better. It would be the managers serving you, not the others. Nonetheless, the place is always packed full of the local asian folk, which is a good thing. I can understand why, it's cheap, and the food is quite decent (they can cook the short ribs a bit more).  This time with 5 people, we paid $11 a person. If it wasn't for the only dim sum place in proximity, and my co-workers loving it so much, I wouldn't come back. I really don't need to be treated like a 2nd class citizen.}","{date=2017-09-13 02:29:54, stars=1.0, text=We ordered the duck. It looked and tasted like fried plastic. I had a watery bowel movement 30 min after leaving the restaurant. My stomach did not like it either. I have decided. I will only eat Mandarin restaurant Chinese food from now on. I do not think I can handle authentic Chinese food because it is disgusting and poor quality meat. Lots of tiny bones in the meat by the way. I felt like I was eating scraps fed to dogs - and I paid to experience this?Noodles I did not try.}","{date=2014-11-02 18:28:30, stars=3.0, text=Came at 11ish AM on a Saturday, and didn't really have to wait for a table.Standard dim-sum service. Really nothing much else to say. Environment is quite nice though for a dim-sum place. Also it's cart-service.}","{date=2014-03-19 05:06:47, stars=4.0, text=Very busy on weekends, but definitely more food and cart options then during the weekdays, when you won't catch yourself in line. Good food, the only Dim Sum in Mississauga with Sweet and Sour Pork Feet w/ Eggs (sounds gross, but its believed to be very nutrional, as the Vinegar in the soup helps purify the blood).}","{date=2014-05-31 15:45:53, stars=1.0, text=won't be back againAt most, only the coke was good. It's the only thing that came at the right temperature}","{date=2015-12-27 18:57:28, stars=5.0, text=This is probably the most underrated restaurant on Yelp in Mississauga. Largely because of all the 1 star reviews for poor service. Despite this, the place constantly has line ups for their dim sum so they must be doing something right. I've honestly never had a bad dim sum dish here. Har gow, beef balls, sticky rice, lotus leaf rice, shiu mai, tofu with crab meat, congee, pig feet, etc.. Everything is great. The service is... plain spoken and frantic but that's dim sum for you. It's certainly not worse than other similar restaurants.}","{date=2014-02-10 03:41:33, stars=2.0, text=We used to go here quite a bit for dim sum, but lately we've been going elsewhere.  Today we found ourselves there for a last minute family dim sum brunch.  I was reminded of why we don't really go there anymore...1)  The layout: Depending on where you sit, you may get hot dim sum fresh off the carts, or you may get that cart that has "onesies" of everything left over....which implies you may have to wait quite awhile for that one item you've been jonesing for.  You could order it too, but that can take some time.  2)  The quality:  Sometimes it's good, sometimes it's meh.  It's rarely excellent. 3)  The wait:  OMGoodness.  On a Sunday morning at noon, you can expect a hefty wait especially if you're in a group larger than 4.  I don't even attempt Saturday morning.  I'd have to assume that the rush dies down after 2 pm but don't quote me on that!I'd say it's a good place to go if you're a dim sum newb and you like to see the items before you order them.  But otherwise there are better options out there.}","{date=2016-08-08 02:33:22, stars=2.0, text=Bad reception from the hostess. We ordered items but were later told some of them are not available. We switched but when the bill came it still included the switched items. The waiter had to go validate.Food was so-so, better for post bar consumption. Washrooms had not been taken care of for at least several hours, paper everywhere,...}","{date=2017-11-24 04:15:12, stars=1.0, text=Have been there many times for dim sum and was always great. First time for dinner and the service was so bad!! Will not be back. Glasses were dirty with food stuck on them and fingerprints everywhere. Pretty scary. Felt like it was such a hassle to have us eat there. The wait staff constantly reach over you to serve or take away things from the table. It was an experience I won't forget anytime soon}","{date=2014-01-24 18:49:59, stars=4.0, text=Their dim sum is a bit pricier compared to other places but their spring rolls have got me hooked!}","{date=2013-03-25 18:53:55, stars=3.0, text=As far as DimSum goes these people work hard, that is clearly evident. Food is never far away, if you see something that you like you'd better get it because the place is packed and it might not be there the next time the cart comes around. The food is good although not the best by most standards. Most of the time the food is fried so you can forget about individual flavors. Thankfully there is quite an amazing variety of foods and it is fresh. I loved the octopus as well as the wonton. Chicken feet were available so the wife was impressed. We got there late(230pm)so DimSum was wrapping up and as I said earlier the staff were in the midst of transforming the dining room, the staff is on point!}","{date=2009-11-02 19:16:42, stars=2.0, text=I have been to Emerald many times in the past 15 years.  They used to have pretty good dim sum.Now that I'm old enough to form my own opinion, my view of them is somewhat tarnished.1) the dim sum is often recooked and carted so often that it arrives cold2) the carts have some of the most inefficient routes, such that it is impossible to get the dishes you want unless you get up and hunt them down3) slow service - it took quite a while to get change for the bill.  i would have thought they wanted a faster turnaround rate.4) they're not exactly cheap for chinese food.5) this one really bugged me - last time I went, close to end of dim sum, and they cracked out the vacuum and started vacuuming right next to my table.  Not sure about everyone else, but i don't particularly want to eat vacuum dust, nor do I enjoy the sights and sounds.}","{date=2013-11-03 19:27:24, stars=1.0, text=The phrase "looks can be deceiving" certainly applies here. Although the decor is nice with bright lights, white tablecloths and golden chair covers, it's ultimate downfall is the food. The majority of dim sum items were deep fried. Where were the steamed bamboo baskets and rice noodle rolls? Cart upon cart  of fried food came by multiple times before we even had one rice noodle roll cart. Even the rice noodle roll was disappointing. Good rice noodle rolls have a very thin skin. These were very thick. I asked one woman pushing a cart what dumplings she had and she said one was a "shrimp biscuit". I was dismayed to find it was one tiny shrimp no bigger than my thumb completely surrounded by ground pork.The staff were awful. Apart from yelling at each other from across the room, they were curt when we asked for more hot water and they were not very nice. One cart lady got impatient and annoyed when we called her over to our table after she skipped us. After asking for the fried noodles on her cart, she stamped our card, then said she would get us a warm plate. She disappeared, and we didn't see her again. We were about to ask someone about this, when another lady came with a plate of noodles. They were microwaved!!!! I think it's safe to say I'll never come back here again. There are so many other good dim sum places (Richmond Hill/Markham) that are definitely worth the drive. Do yourself a favour and don't eat here.}","{date=2014-02-15 18:02:52, stars=2.0, text=Meh.  If the ingredients were a little fresher and the recipes are a little healthier, it would be worth a review.  MSG ME!  (No, please don't)}","{date=2017-10-07 15:20:35, stars=3.0, text=Nothing special esp for toronto. Probably one of the poorest dim sum i have had in TO. Selection was very poor. Service slow. And they never came to our side with food.}","{date=2015-10-13 18:47:56, stars=1.0, text=The worst dining experience in my entire life. I'm not talking about the  foods, but the quality of service. The dim sum lady was rude, we asked three times to not serve food that we didn't want and she still ignored us. I spoke to the general manager and she seemed not to care or even at least saying sorry.}","{date=2017-10-30 08:50:11, stars=4.0, text=Whenever my friend and I are in the mood for dim sum, we come here for their discounted dim sum times (9am-11am, 2pm-4pm). The food is always hot, fresh, and delicious. We got pork spare ribs, har gow, shu mai, crab claws, beef balls, tripe, and rice noodle rolls with shrimp. Everything was so good and only came to about $15/person which is great. I'm definitely coming back here.}","{date=2013-03-29 17:34:31, stars=1.0, text=Went for Dim Sum when it was super packed. Their dim sum is terrible. Everything had corn and ham in it. I've never had corn and ham in my dim sum until this restaurant. The carts with the same food go around and around and around with barely anything new. The food is dead cold when you get it because they just circle around multiple times. We did not understand how it was so packed when the food was absolutely terrible. There was that one lady that kept circling around with the same cart with dim sum nobody wanted that she kept persuading people to get. Never get anything from her, there is a reason why she keeps going around with the same items (not newly replenished ones at that).We noticed it was packed with a lot of non-chinese as well, not sure if their taste is different from what we are used to from all the other dim sum places we've been to our whole life, but their hargow and siumai were the worst I've ever had in my life.Not worth the $70 we had to pay. Maybe their regular non-dim sum menu is better, but this experience has turned us off completely from going back.}","{date=2015-12-31 05:50:02, stars=3.0, text=You might need to be rude to eat.Emerald is a Chinese Restaurant that mainly serves as a banquet hall. The chairs are all covered with fake silk seat covers similar to an old banquet hall trying to look newer. This place is geared for very large groups. The food is decent but the service is geared towards survival of the fittest. For Dim Sum it seems that you need to make yourself very visible in order to get served. Occupied ladies wheel the carts around with no set predictability or pattern. "Excuse me can we have some more mustard sauce"? might be the way you might ask for some sauce. Here, you might have to say "WHERE IS THE SAUCE?" But if you don't mind being rude (because they don't) then you might like this place. Try sitting closer to the window if you can as the Dim Sum carts seem to frequent that area more.}","{date=2012-11-21 23:52:34, stars=1.0, text=Oh boy have I ever got news to share here.Have been to this restaurant regularly over a 5 year period.The reason I ate here was for nothing more than the food. More on this later.I noticed that as each year passed, the food quality and cleanliness declined. I was NOT SURPRISED that 5 months ago the Food Inspectors closed the place down. It is filthy. In March this year, I walked into the men's room to find a floor covered in vomit! In most restaurants, this would be cleaned up immediately.From Day 1, I felt the rudeness and aggression from the wait staff. In particular, an elderly heavy set Waiter who actually scowls when serving or taking orders.I once brought some European guests of ours fresh from the Airport for Dinner and they were shocked/disgusted by the rudeness. My friend asked the Waiter if he had a problem and if all Canadians are this rude lol! The bill was about $70 and we did not give him a penny of tips.So, back to the service. This year I finally decided that I will never eat in this place ever again. 1. The people are R U D E !!!2. The place is dirty3. Overpriced Those of you who are into Holistic life, you can feel the bad energy in the room.Stay away!PS unfortunately YElLP 's lowest rating is One star so I give it accordingly. In reality it deserves NO STARS!}","{date=2016-09-12 00:12:51, stars=1.0, text=Finally had reason to create a yelp account. Came for a Sunday night family dinner but there were 2 wedding receptions booked. Competing sound systems with loud music and emcees, slow service, and generally terrible experience. One star for the ok food and sympathy for the wait staff.}","{date=2015-09-20 04:23:17, stars=1.0, text=This place is TERRIBLE! Dim sum was cold and had very limited option. So we ordered a stir fried rice noodle hoping it would be better. Little did we know it would take over 30 mins to be served and sooo not worth the time cus it came out lacking in flavour and had a burnt smell. But nothing was worst then the HORRIBLE service!!! Rude grumpy old waiters walking around ignoring you and giving dirty looks when u try to get their attention or ask for something.To top off our EXTREMELY UNPLEASANT experience there we were given a bill of $75.00 !! For 2 ppl! I was charged almost $5.50 for tea that I didn't even touched! We've ordered way more at other restaurants and our bill usually estimates around $$40-$50.Needless to say we are NEVER ever returning there, just even the thought of it sickens me, ugh!(I'm only giving this place 1star cus I had to, if I could I would give them a negative one million star)}","{date=2015-06-27 02:03:56, stars=1.0, text=The worst service ever!!! I wish there was a 0 star option so I could rate them. I came here for dinner with family. My father asked for extra chopsticks and the server asked him WHY he needed new chopsticks??? After explaining that he dropped his, and needed new ones, a pair of chopsticks (taking from a dirty stall) finally were given to him from across the table, BARE HAND. You probably have to know some Chinese when ordering food here, as most of the staffs don't speak English. I felt like we were begging for food and service attention at this restaurant; I don't know how about you, but to me, it just killed my appetite. We ordered deep fried oyster, sea-food fried rice, fried noodle, spicy scallop and pecking duck. And I have to say, these were one of the worst Chinese dishes ( I rated Mandarin 3 stars-so you know I am not a picky eater here). The rice was soggy, the spicy scallop was way too salty, while the fried noodle was just dry and bland. My dinner was ruined. I will never come back. Avoid at all cost!!!}","{date=2017-09-03 22:14:15, stars=5.0, text=This is as close as you can get to Hong Kong dim sum here in Mississauga.I have been eating here for almost 10 years. Surprisingly I managed to write my review just now so I'm a little behind. The place is huge - banquet style seating. They are open pretty early in the morning and close very late at night so it's very convenient for a Chinese restaurant in the west GTA.The choice is yours: Pick up dim sum from the carts slowly strolling in the aisles or order from their menu. From their "Har Gau" shrimp dumplings to their simple Rice Toppings, you can always find something good to eat here. When I first arrived at Emerald, I didn't quite know what to expect. It was busier than a shopping mall on a snowy weekend and I probably felt extremely overwhelmed by all the people waiting in the front lobby. What I have always learned is that if the restaurant is filled with patrons of its own nationality then the chances are that the food is very good and trustworthy. I am telling you all, the food is very good here.Dim sum carts: Depending on the type of food that you pick out will justify the price you must pay. Noodles and veggies are cheaper. Seafood items are higher in cost. If you love seafood as much as I do, you won't mind paying for it.Menu: I have eaten several items on the list here for dinner and they all taste great. If you order the crab, it can get quite expensive so choose wisely based on your budget. When dining here with out-of-town family or friends, I would always recommend buying the crab.So what has put off many people is the very rough service treatment. You need to keep in mind that delicious Cantonese style food does not equal to quality service. As many people have often complained that it can and will be extremely busy during weekends and holidays, I'm listing several tips for all of you to enjoy the "five-star" eating experience.Tip #1: Plan wisely - Weekend dim sum lunch hours is crazy busy and holidays is even worse. Unless you are absolutely craving their food, beware of rushed and rude service.Tip #2: All your favourite dim sum dishes may or may not be on the carts. You can order dim sum dishes straight from the kitchen for the same price. But be prepared to wait at least 15 minutes for your order to come out. The same can be said about ordering menu items during dim sum hours. I have seen people walk out because their order never arrived after eating several dim sum dishes.Tip #3: When you need some service, get their attention! Make eye contact and call over the staff wearing black vests. They are the ones you need to order from so don't be shy and call them over. Tip #4: When asking for something, no need to be rude to them even though they are rude to you. When speaking with us needy/hungry/polite Canadians during busy times they are very direct because they are trying to keep up with orders. Just say what you need and follow up when they forget. If you ask for too many things then they will make you feel unwelcome.For more food reviews and blogging, check out my blog at https://spicychopsticks.blog}","{date=2017-10-10 03:16:11, stars=4.0, text=Last Friday, my team from work went to Emerald for dim sum for lunch. I drove three of my colleagues over to the restaurant. My other colleague took two others. I decided to go against Google Maps. Sometimes, I wonder how useful it is to do a u-turn instead of turning left at the intersection. This plaza gets busy. We got there just before noon, so we were fine. We got a round table. There were seven of us. We got tea while we waited for the dim sum carts to cycle. We ordered a whack load of dishes during our first five minutes of being there! So much for pacing how much we eat. The dim sum was delicious. Some of my favourites are the following:- Crab claw balls (so good, especially the meat in the claw)- Har gow- Sticky rice in fragrant leaves- Rice rolls (shrimp and barbeque pork)I had so much protein that I enjoyed the gai lan with fish. I ate more greens than the one sliver of fish. We split the bill. Each person ended up paying $22, which included the tip. I was good with it. My boss said that it was expensive. This restaurant accepts credit, debit, and cash. The dim sum quality was amazing. This restaurant houses a ton of people. At one point, a tour bus full of tourists came in. I would guess that it easily seats 200 people. I'd come back here again. It's fully licensed, which is another reason why I need to come back.  (215)}","{date=2013-11-23 18:01:01, stars=1.0, text=This is by far the worst. I like how it still have the authenticity of rolling carts with food. But the food quality is not good and service is bad. I asked for service for 2 times in a row and because of that, I was given attitude cause I asked him to get water once and sauce the other time. Because of the rolling carts food sometimes comes out cold.}","{date=2011-01-04 14:19:01, stars=2.0, text=I've been here twice. Once during Chinese New Year. They have good dim sum.The second time my family went wasn't so good. The food was a little cold. We found a rubber band in the vegetables. The manager crossed off the item on the list after explaining what happened.They likely did not wash the veggies since the rubber band was found among them. Is that standard in restaurants?Despite the manager having crossed the item off the list, we still got charged for it. We had to talk to a few staff members until we found someone that could speak adequate English (the manager was busy elsewhere).Dim sum was good, admittedly. The service, however, is not so good. I would avoid the place.}","{date=2014-05-01 21:13:24, stars=1.0, text=Dirty, cheap ingredients, bad service most of the time.  How do they stay in business??!?!?}","{date=2017-08-13 19:40:36, stars=1.0, text=What a joke. Service was awful and dim sum was terrible. Don't believe the hype for best dim sum in Mississauga. Go to Rol San in Toronto. Never coming back.}","{date=2010-09-30 17:41:09, stars=3.0, text=This is one of the few places I've seen that still has carts! I miss that. Given, I guess you have to strategize to know what's fresh or not. The food was okay. Not spectacular. but very good. A great place to come for a work celebration or work lunch.  The clientel is mostly local Chinese folk, or people that work near by. They are SO aggressive here! On many of an occasion they would put plates on our table, and say "here, you like this!" We're like...no, thanks, full "No! you like this!" And when I say no a second time, they take it back (one of them was ever grumbling how we didn't want vegetables!)It's like they make a commission here or something. I would suggest, know what you want, and don't succumb to their ploys. They are super busy around here, so don't be afraid of putting up your hand and flagging someone down. i'm not sure of the price for each dish, but for 10 people, we paid about $18 PER PERSON....}","{date=2018-07-02 23:00:47, stars=4.0, text=Went on a Sunday​ morning, around 11 and was seated immediately​. I'm not sure why the ratings for this place is so low, but I'm a fan. Great place, far better than any dim sum place back in the states. They were missing some of my dim sum favs but everything we had was really great. Only downside was that we had a large party, and when a cart comes by, we'd take a couple of plates, but all the food would be gone in a minute. We would then have to sit a while waiting for the next cart to come over and since we were in the far corner, carts were few and far between.}","{date=2013-04-08 17:01:48, stars=1.0, text=Food was awful, I do like Chinese food, but this one was tasteless and smelled terrible. I couldn't wait to get my bill and leave. They call this thing restaurant. I wouldn't go there again even if it is only one place on the earth where I can get food. highly disappointed!}","{date=2018-05-05 19:20:30, stars=5.0, text=Just visited this restaurant for DimSum.Good variety. Pleasant servers .Spacious and Good Food.}","{date=2011-06-11 12:56:17, stars=3.0, text=We've come to Emerald for both dim sum and dinner before.  This review will be for dinner.Our group of 6 arrived around 7pm on a Friday night.  The restaurant was about half full.  They seated us at a round table that was a bit lop sided and unsteady because it was a piece of plywood screwed to some fold out table legs.  We asked to be moved to another table since we saw plenty available ones and they obliged. We ordered one of the set menus for $88 which included:- House soup- 1 jumbo steamed crab in a light butter sauce with onions.  I don't eat crab that often but it's probably one of the best I've tasted.  Lots of meat, not too much work needed to dig it out.  The meat was very fresh and not overdone.  - Cold jellyfish and roast pork with crispy skin- Stirfry scallops and shrimps with veggies and jumbo mushrooms- Fish and deep fry tofu- Stirfry tung choiIn addition, we also ordered snow pea leaves with garlic and half a roast chicken.Food came fast and super hot.  Portions were gigantic especially the tofu/fish and snow pea leaves dishes.  Although we did have to order bowls of white rice separately as it was not included in the set menu.Dessert was included and it was cold orange slices and a warm sweet taro/tapioca soup.Overall a fantastic meal and way more than enough food for 6 people.  We had 2 jumbo containers of leftovers with the bill coming to $140 before tip.}","{date=2016-04-20 11:22:56, stars=5.0, text=Never had a bad experience here. The food is extremely authentic, and if you come for lunch it literally arrives in seconds. My favourites are the chicken feet, shrimp dumplings, and congee.   I understand that most people complain about the service, but you have to understand that this isn't your typical American sit-in restaurant. Overall great place for dim sum and I'll definitely be back!}","{date=2017-01-21 02:27:26, stars=4.0, text=This is one of the Cantonese restaurants that I frequent in Mississauga.I come mainly for the dim sum lunch.What I like is the food is still pushed around on carts just like in the old school days.As a result, you get to eat pretty quickly on your arrival.One thing to watch out for is because you are hungry on arrival, you might tend to over order! Like they say your brain is bigger than your stomach! However no worries here as we pretty much always take home the left overs for our kids.}","{date=2013-08-02 05:07:17, stars=5.0, text=I've been to many authentic Chinese restaurants in my life. This one is the best. The staff is very professional and helpful, the place is clean and the food is exceptional. There is one TV screen, and instead of the usual Highway Traffic-Camera and the Breaking News, they show clips of how traditional dishes are made in China. I will definitely be back with more friends.}","{date=2013-06-21 23:57:25, stars=1.0, text=The food is horrible. They should be embarrassed to serve this. Had lemon chicken which was certainly cooked and served days before, and rethermed for us. Completely inedible. Save your money and frustration. Avoid this place at all costs.}","{date=2015-06-28 22:24:09, stars=3.0, text=Came in for lunch today, but not for dim sum. It was for my nephew's baby moon, so a ten course was ordered.This is not in my neck of the woods either, so I can't really compare it to other places in Mississauga.Since it WAS dim sum hour, it was really hectic. At no fault of the restaurant though. Customer service was still pretty good here.The food was average, we had the standard banquet dishes of crab claw ball, garlic pea shoots, steamed fish, crispy chicken etc. Nothing stood out, and nothing was terrible. We did order a few dim sum dishes afterwards, like chicken feet and siu mai. I can't comment on the pricing either. Overall it was alright, but like I said, I'm never in Mississauga, so I'd only be back if there was a function there.}","{date=2014-05-23 12:02:13, stars=1.0, text=The service was nearly non-existent and extremely rude. Had 3 or 4 different servers come to our table and they would literally throw our plates on the table and leave without saying anything. Our food came out one at a time (there were 8 of us) and there was probably 5-10 minutes in between each order. It really was that bad. Funny how all the other tables around us got great service and their food delivered in a timely fashion and all together. NEVER going back}","{date=2015-11-01 02:20:23, stars=5.0, text=Very authentic chinese food. Excellent service, clean, nice ambience.  The decoration is typical to fine chinese restaurants in China.  I have been in different parts of China several times, so I can truly know when a place is authentic.  The waiter who assisted us was very kind and trying and achieving his best to understand us and serve us good.  The food was fresh, tasty and good quality.  Everything seemed clean and ambience medium-medium/high class people.  Is the type of chinese restaurant you will enjoy if looking for authentic and fine chinese food.  Prices a bit high but the restaurant deserves it for the food/service/ambiance quality.So far the best chinese restaurant we have found in Mississauga.  We took our leftovers home happily and definitely going back!}","{date=2014-09-21 16:14:51, stars=3.0, text=One a few (that I know of) dim sum restaurant in Mississauga on the way to the premium outlets.Come before 11am as their was a huge back log after that, even though the place is large.This is a cart service place but a few items you have to order from the waiter (en.  Sui mai/pork dumplings which is a staple of dim sum food choices so go figure - they finally came and pretty small).Any ways, had better (in Markham) and worse (downtown toronto Chinatown) so 3 stars is average}","{date=2016-01-24 21:26:25, stars=1.0, text=Horrible  ..,. just awful Never go back again Overpriced and low quality food and service}","{date=2016-01-29 20:09:02, stars=3.0, text=The food is okay. I don't know if it's kung pao chicken or the general tao but one of them tastes horrible. The lemon chicken however tastes very good. It's a normal tasting Chinese food that I find quite overpriced.}","{date=2018-10-07 00:44:35, stars=4.0, text=I took my clients here.  The experience was the usual.  We ordered a number of dishes.  Unlike some other Chinese restaurants, this location does not provide a complimentary pork bone Chinese soup to start.  But they do provide complimentary red mung bean soup.I was treating caucasian clients.  I was very happy that they did not offend my clients asking if they wanted forks and knifes -thank you.  Eventually they needed and we were served.We were provided one pot of tea, eventually two pots but the tea leaves were not replenished and so tea was quite washed and light.At the end of our dinner, we were served red mung bean soup.  It was moderately sweet.  It was okay, but quite filling because it's made with glutinous flour or just boiled too long that the tapioca has thickening it.  I give the server props for observing my caucasian clients did not like it and quickly came to the rescue with fortune cookies -to that my client were like "Yea! Awesome!"It could be five star, but two reasons stopped me.First, at a previous visit for dim sum, I found that when I had caucasian clients with kids, the servers take advantage of the kids amusement with crab claw dim sums because kids like playing with food.  I will honestly say it's pretty pricey to order half a dozen of premium dim sum dishes.Second, this restaurant does not serve any dishes that are diabetic/high cholesterol customers.  I can never take health sensitive clients for dim sum and the dinner options really don't have clean options.}","{date=2016-05-30 23:03:07, stars=3.0, text=I'm told this restaurant has been around for numerous years and the rest of my party were regulars here. Inside it reminded me of a typical Chinese restaurant - golds and reds, fish tank, things weren't new but not too old. There were a number of tables seated and the bigger tables around the edge of the restaurant were filled or had reservations.There was a dinner combo set menu available as well as a regular à la carte menu. My table ordered off the à la carte, probably for flexibility in getting exactly what we want.The soup came out first - it looked hopeful with greens and meats visible, but the taste was watery and bland. It was also apparent the service was going to feature kind-hearted ladies with fair-to-average serving skills as the soup ladling job was all over the place, literally.Other dishes came out eventually, featuring sweet and sour pork, thousand island sauce deep fried pork, egg tofu with baby shrimp, garlic shoots and squid with chili sauce, XO sauce string beans, fish fillet with peas...a collection of fairly simple dishes that one could make at home, but would require a hefty grocery run to accomplish all in one dinner. Overall everything tasted good and nothing was poorly done, though the garlic shoots and string beans were much spicier than expected. There were no food-related complaints around the table otherwise. Dessert was sliced oranges and red bean soup - standard, nothing special.I was impressed by the variety of dishes available at Emerald and satisfied by the pricing - my table of 16 came out to only $16.50 each for what I felt was a large variety of dishes. While nothing stood out nothing was utterly dissatisfying either, which is a great accomplishment given the size of my party. Personally - I felt more interesting and more flavourful dishes can be found in Markham and Richmond Hill, but for being in Mississauga it wasn't bad at all.}","{date=2018-02-10 23:25:22, stars=5.0, text=I went here today for dim sum and I love it! The dim sum ordering style may be outside your comfort zone if you're not used to it.You order food as you see them come around on carts, flagging down workers and picking however many dishes you want from the cart. They will mark down the types of dishes you got, which will add to your total. Different carts have different items, but the same carts will come around quite often.It's a great way to eat with your eyes, picking food that looks good and they taste good too! Highly recommend the deep fried squid tentacles, a light crunch on the outside but soft and moist squid on the inside!}","{date=2013-12-06 00:13:01, stars=4.0, text=I'm shocked I haven't reviewed this place... This is my go to dim sum place on the weekend in the ssaug.Who doesn't love carts of steaming bamboo containers being pushed around you? It's packed though. Go before 11am or after 1pm. They serve dim sum until 4pm on the weekends. Then it becomes a regular Chinese restaurant - I have totally made that mistake before, although their chicken wasn't bad.This places charges for tea, so make sure you want tea before you ordered it. It can get pricey and that's how a lot of dim sum places get you!I see some of the other reviewers saying how you had to be firm and you do. All the cart ladies want to pawn their food on you... Especially if you aren't Asian... Also, if you want to order anything off the menu or even get extra napkins, you will have to flag down one of the servers in the black vests. They take their division of labour very seriously.You should order a side of the stir fry snow peas. They don't normally bring that out. It's solid!My personal favourites are the scallop dumplings (they are known for their scallop dishes), seafood dumplings, chicken feet, crab claw and fried tofu wrap...I'm probably going this weekend. Thinking about it makes me hungry.}","{date=2015-03-17 14:45:17, stars=3.0, text=Took my parents here recently to celebrate a birthday and left disappointed. This place used to have great dimsum but now I no longer think it's worth the drive. The chicken feet was really good though, so many if I have an exclusive craving for that I'll come back. The service is a lot better rhan what it used to be and we were pleasantly surprised that the staff were friendly and attentive.}","{date=2013-06-21 23:51:01, stars=1.0, text=Vile.  This was one of the worst examples of food quality out there. The fried rice was just plain greasy but not fried and crispy like it should be.  The lemon chicken was HARD and a funny color - so disgusting.  It was dismal and inedible. I would absolutely recommend you MISS this place.}"]}]}}}